Revit 2027 API
StructuralSectionStructuralTees Constructor
 Creates a new instance of Structural Section Tees shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionStructuralTees(
	double width,
	double height,
	double flangeThickness,
	double flangeThicknessLocation,
	double webThickness,
	double webThicknessLocation,
	double webFillet,
	double flangeFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double boltSpacing,
	double boltSpacingWeb,
	double boltDiameter,
	double slopedFlangeAngle,
	double slopedWebAngle,
	double topWebFillet
)
Public Sub New (
	width As Double,
	height As Double,
	flangeThickness As Double,
	flangeThicknessLocation As Double,
	webThickness As Double,
	webThicknessLocation As Double,
	webFillet As Double,
	flangeFillet As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	principalAxesAngle As Double,
	sectionArea As Double,
	perimeter As Double,
	nominalWeight As Double,
	momentOfInertiaStrongAxis As Double,
	momentOfInertiaWeakAxis As Double,
	elasticModulusStrongAxis As Double,
	elasticModulusWeakAxis As Double,
	plasticModulusStrongAxis As Double,
	plasticModulusWeakAxis As Double,
	torsionalMomentOfInertia As Double,
	torsionalModulus As Double,
	warpingConstant As Double,
	shearAreaStrongAxis As Double,
	shearAreaWeakAxis As Double,
	boltSpacing As Double,
	boltSpacingWeb As Double,
	boltDiameter As Double,
	slopedFlangeAngle As Double,
	slopedWebAngle As Double,
	topWebFillet As Double
)
public:
StructuralSectionStructuralTees(
	double width,
	double height,
	double flangeThickness,
	double flangeThicknessLocation,
	double webThickness,
	double webThicknessLocation,
	double webFillet,
	double flangeFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double boltSpacing,
	double boltSpacingWeb,
	double boltDiameter,
	double slopedFlangeAngle,
	double slopedWebAngle,
	double topWebFillet
)
new :
        width : float *
        height : float *
        flangeThickness : float *
        flangeThicknessLocation : float *
        webThickness : float *
        webThicknessLocation : float *
        webFillet : float *
        flangeFillet : float *
        centroidHorizontal : float *
        centroidVertical : float *
        principalAxesAngle : float *
        sectionArea : float *
        perimeter : float *
        nominalWeight : float *
        momentOfInertiaStrongAxis : float *
        momentOfInertiaWeakAxis : float *
        elasticModulusStrongAxis : float *
        elasticModulusWeakAxis : float *
        plasticModulusStrongAxis : float *
        plasticModulusWeakAxis : float *
        torsionalMomentOfInertia : float *
        torsionalModulus : float *
        warpingConstant : float *
        shearAreaStrongAxis : float *
        shearAreaWeakAxis : float *
        boltSpacing : float *
        boltSpacingWeb : float *
        boltDiameter : float *
        slopedFlangeAngle : float *
        slopedWebAngle : float *
        topWebFillet : float -> StructuralSectionStructuralTees
Parameters
width Double
 Section width.
height Double
 Section height, depth.
flangeThickness Double
 Flange Thickness.
flangeThicknessLocation Double
 Flange Thickness Location.
webThickness Double
 Web Thickness.
webThicknessLocation Double
 Web Thickness Location.
webFillet Double
 Web Fillet - fillet radius between web and flange.
flangeFillet Double
 Flange Fillet - fillet radius at the flange end.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle Double
 Rotation angle between the principal axes and cross section reference planes.
sectionArea Double
 Cross section area.
perimeter Double
 Painting surface of the unit length.
nominalWeight Double
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis Double
 Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis Double
 Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis Double
 Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis Double
 Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis Double
 Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis Double
 Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia Double
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus Double
 Section modulus for calculations of torsion stresses (Ct)
warpingConstant Double
 Warping constant (Cw, Iomega, H)
shearAreaStrongAxis Double
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis Double
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
boltSpacing Double
 Standard bolt spacing in the flange, in. (mm)
boltSpacingWeb Double
 Standard bolt spacing in the web, in. (mm)
boltDiameter Double
 Maximum bolt hole diameter, in. (mm)
slopedFlangeAngle Double
 Sloped flange angle. (rad)
slopedWebAngle Double
 Sloped web angle. (rad)
topWebFillet Double
 Top Web Fillet - fillet radius at the top of web.
See Also
Reference
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace